[
    {
        "title":"Bootstrapping Project CodeIgniter4 menggunakan Docker",
        "slug":"bootstrapping-project-codeigniter4",
        "image": "https://miro.medium.com/v2/resize:fit:660/format:webp/1*MqmWN2HVl-A-kvT05rbYdg.png",
        "synopsis":"Mengembangkan aplikasi CodeIgniter4 lebih mudah dengan menggunakan Docker, berikut caranya",
        "author": "Fahrul Septiana",
        "username": "fahrulseptiana",
        "date": "2025-10-02T10:08:41+07:00",
        "body": "Pada dasarnya pengembangan aplikasi sudah sangat dipermudah dengan adanya docker, karena setiap tools yang diperlukan sudah di-bundling dalam satu image yang siap digunakan.\nCodeIgniter 4 (selanjutnya kita sebut CI4) memiliki requirements untuk dapat dijalankan, diantaranya ada:\n\n- PHP 8.1 atau lebih baru\n- Ekstensi PHP Wajib: intl, mbstring dan json (ekstensi json preinstalled di php 8)\n- Ekstensi PHP Tambahan: mysqli, curl, gd dan simplexml\n\n## Membuat Docker Image Siap Pakai\nKarena kita sudah mengetahui requirements di atas, langkah selanjutnya, kita bisa membuat custom image dengan basis image PHP 8.1 dari registry hub.docker.com dan memilih image dengan tag 8.1-apacheagar lebih mudah untuk digunakan dan familiar karena dekat dengan konfigurasi apache di XAMPP.\n```bash\ndocker pull php:8.1-apache\n```\nAda beberapa ekstensi yang perlu diinstal secara manual, di dalam image yang kita pull sebelumnya sudah ada perintah docker-php-ext-install yang bisa kita manfaatkan.\n\nSecara bawaan, php:8.1-apache menggunakan sistem operasi linux dengan distro debian. Maka dari itu, untuk melakukan instalasi program kita bisa menggunakan perintah apt-get\n\nUntuk memasang mbstring, kita perlu instal library oniguruma terlebih dahulu, kita bisa pakai libonig-dev dari repository debian secara langsung\n```bash\napt-get install libonig-dev\n```\nKita juga memerlukan libicu-dev untuk ekstensi intl\n```bash\napt install libicu-dev\n```"
    },
    {
        "title": "5 HP Murah dengan Layar AMOLED, Harga Mulai Rp 2 Jutaan",
        "slug": "5-hp-murah-dengan-layar-amoled-harga-mulai-rp-2-jutaan",
        "image": "https://awsimages.detik.net.id/community/media/visual/2025/08/26/infinix-hot-60-pro-plus-1756195197502_169.jpeg?w=700&q=90",
        "synopsis": null,
        "author": "Fahrul Septiana",
        "username":"fahrulseptiana",
        "date":"2025-10-02T10:08:41+07:00",
        "body": "**Jakarta** - Banyak HP Android murah di rentang harga Rp 2-3 juta yang saat ini sudah dilengkapi layar AMOLED. Konsumen tetap bisa menikmati display yang superior meskipun memiliki budget yang terbatas.\nLayar AMOLED menjadi salah satu fitur yang banyak dicari konsumen karena menawarkan warna tajam, kontras tinggi, dan konsumsi daya yang efisien. Biaya produksi panel ini sudah semakin murah, sehingga banyak vendor ponsel yang beralih dari panel LCD ke AMOLED.\n\nBagi kalian yang memiliki budget sekitar Rp 3 juta atau di bawahnya, berikut ini lima rekomendasi HP murah dengan layar AMOLED yang bisa jadi pilihan di tahun 2025.\n\n## Samsung Galaxy A17\nSamsung Galaxy A17 versi 4G dilengkapi layar Super AMOLED berukuran 6,7 inch dengan resolusi 2340 x 1080 (FHD+). Layar ini memiliki refresh rate 90Hz dan dilindungi Gorilla Glass Victus.\n\nSamsung membekali ponsel ini dengan chipset MediaTek Helio G99 yang dipadukan dengan RAM 8GB dan memori internal hingga 256GB. Ponsel ini menjagokan kamera utama 50 MP dengan OIS dan One UI 7 yang dilengkapi fitur pintar seperti Circle to Search dan Knox Vault. Galaxy A17 dibanderol dengan harga mulai dari Rp 2.999.000.\n\n## Vivo Y400\nHP murah lainnya dengan layar AMOLED adalah Vivo Y400. Ponsel ini mengusung layar AMOLED berukuran 6,67 inch dengan resolusi FHD+, refresh rate hingga 120Hz, dan tingkat kecerahan hingga 1.800 nits.\n\nChipset Snapdragon 685 mengotaki kinerja Vivo Y400, dengan RAM 8GB dan memori internal hingga 256GB. Kapasitas baterainya 6.000 mAh dengan pengisian cepat 44W, dan kemampuan fotografinya mengandalkan kamera utama 50 MP dengan OIS. Ponsel ini tersedia dengan harga mulai dari Rp 3.199.000.\n\n## Infinix Hot 60 Pro+\nInfinix Hot 60 Pro+ memegang rekor sebagai ponsel dengan layar lengkung tertipis di dunia dengan ketebalan hanya 5,95mm. Layar lengkung ini menggunakan panel AMOLED berukuran 6,78 inch dengan resolusi 1,5K, refresh rate 144Hz, dan tingkat kecerahan hingga 4.500 nits.\n\nKinerjanya didukung chipset MediaTek Helio G200 dengan RAM 8GB dan memori internal hingga 256GB. Ponsel ini dilengkapi kamera utama 50 MP, baterai 5.160 mAh dengan pengisian cepat 45W, dan menjalankan sistem operasi XOS 15.1.1 yang membawa sederet fitur AI. Infinix Hot 60 Pro+ dibanderol dengan harga mulai dari Rp 2.599.000.\n\n## Redmi Note 14\nRedmi Note 14 menggunakan layar AMOLED berukuran 6,67 inch dengan resolusi FHD+, refresh rate 120Hz, dan dilindungi Gorilla Glass 5. Ponsel ini ditenagai chipset MediaTek Helio G99-Ultra dan menjalankan sistem operasi HyperOS.\n\nXiaomi membekali ponsel ini dengan kamera utama 108 MP dan baterai 5.500 mAh dengan pengisian cepat 33W. Saat ini harga Redmi Note 14 sudah semakin terjangkau, mulai dari Rp 2,2 jutaan.\n\n## Tecno Spark 40 Pro\nTecno Spark 40 Pro yang diluncurkan bulan lalu mengusung layar AMOLED berukuran 6,78 inch dengan resolusi 2712 x 1220 pixel. Layar ini mendukung refresh rate 144Hz dan dilindungi Gorilla Glass 7i.\n\nSpesifikasi lainnya termasuk chipset MediaTek Helio G100 Ultimate, RAM 8GB, memori internal 128GB, dan baterai 5.200 mAh dengan pengisian cepat 45W. Ponsel dengan kamera utama 50 MP ini dibanderol dengan harga Rp 1.979.000."
    },
    {
        "title":"Siap-siap! iPhone 17 (Mungkin) Lebih Cepat Masuk Indonesia",
        "slug":"siap-siap-iphone-17-mungkin-lebih-cepat-masuk-indonesia",
        "image":"https://awsimages.detik.net.id/community/media/visual/2025/09/10/iphone-17-pro-1757446464875_169.jpeg?w=700&q=90",
        "synopsis": null,
        "author":"Fahrul Septiana",
        "username":"fahrulseptiana",
        "date":"2025-10-02T10:08:41+07:00",
        "body":"**Jakarta** - Sudah tak sabar mau membeli seri iPhone 17 di Indonesia? Tenang, kabarnya deretan iPhone baru itu akan dirilis lebih cepat dibanding perkiraan sebelumnya.\nBagus Hernawan, Apple enthusiast, lewat akun X-nya menyebutkan kalau seri iPhone 17 tersebut akan dijual di Indonesia mulai 17 Oktober 2025 mendatang. Sementara pemesanannya dibuka mulai 10 Oktober.\n\n\"Harga mulai 17 jutaan, paling mahal 42 jutaan,\" tulis Bagus, yang biasanya punya prediksi akurat terkait produk-produk Apple di Indonesia.\n\nDisebut lebih cepat dari perkiraan karena sebelumnya Bagus menyebut deretan iPhone 17 itu akan dirilis pada 24 Oktober 2025.\n\nDiketahui, seri iPhone 17 sudah mengantongi sertifikasi Tingkat Komponen Dalam Negeri (TKDN), yaitu iPhone 17, iPhone Air, iPhone 17 Pro, iPhone 17 Pro Max.\n\nBerdasarkan data dari situs resmi Pusat Peningkatan Penggunaan Produk Dalam Negeri (P3DN) Kementerian Perindustrian, sertifikasi TKDN untuk model-model tersebut telah terdaftar dengan kode A3517 (iPhone Air), A3520 (iPhone 17), A3523 (iPhone 17 Pro), dan A3526 (iPhone 17 Max). Keempatnya mendapat nilai TKDN 40%.\n\nKemudian deretan iPhone baru itu lolos uji Sertifikasi Perangkat Pos dan Telekomunikasi (Postel) dari Kementerian Komunikasi dan Informatika (Komdigi).\n\nPantauan detikINET di situs Sertifikasi Postel, ada empat perangkat yang didaftarkan PT Apple Indonesia. Perangkat tersebut meliputi kode A3517 (iPhone Air), A3520 (iPhone 17), A3523 (iPhone 17 Pro), dan A3526 (iPhone 17 Max).\n\nKondisi ini berbeda saat Apple baru merilis iPhone 16 series setahun lalu. Saat itu, deretan iPhone 16 itu baru mendapat sertifikasi komplit pada April 2025 sejak dirilis September 2024.\n\niPhone 17 series dan Air mendapat kemudahan berkat kesepakatan investasi Apple senilai USD 160 juta (sekitar Rp 2,6 triliun) dengan pemerintah. Investasi ini mencakup pembangunan pusat riset dan inovasi di Indonesia, yang membantu memenuhi regulasi TKDN tanpa perlu pabrik perakitan penuh."
    },
    {
        "title":"Apple Siap Rilis 5 Produk Baru Oktober Ini, Ini Bocorannya!",
        "slug":"apple-siap-rilis-5-produk-baru-oktober-ini-ini-bocorannya",
        "date":"2025-10-02T10:08:41+07:00",
        "author":"Fahrul Septiana",
        "username":"fahrulseptiana",
        "image":"https://awsimages.detik.net.id/community/media/visual/2024/07/20/ipad-pro-m4-2024-12_169.jpeg?w=700&q=90",
        "synopsis":"",
        "body":"**Jakarta** - Setelah September yang sibuk dengan peluncuran iPhone 17, iPhone Air, Apple Watch Ultra 3, dan AirPods Pro generasi baru, Apple belum selesai. Ada lebih dari 5 produk baru yang dirumorkan bakal dirilis Oktober ini.\nBerikut rangkuman bocoran terbaru dilansir dari laman 9to5mac:\n## 1. Apple TV 4K Baru\nApple dilaporkan akan menghadirkan versi baru Apple TV 4K, setelah lebih dari tiga tahun sejak model terakhir diluncurkan. Bocoran menyebutkan perangkat ini akan membawa:\n- Chip A17 Pro, menggantikan A15 Bionic\n- Dukungan Apple Intelligence\n- Chip nirkabel baru \"N1\"\n- Kemungkinan hadir dengan kamera Center Stage\n\nUpgrade ini dinilai krusial, terutama di tengah persaingan dari perangkat streaming milik Google dan Amazon.\n## 2. HomePod mini 2\nGenerasi terbaru HomePod mini juga ikut digadang-gadang meluncur Oktober ini. Beberapa prediksi menyebut:\n- Dukungan untuk Apple Intelligence\n- Chip N1 baru\n- Peningkatan kualitas audio\n- Pembaruan pada chip Ultra Wideband\n\nHomePod mini generasi pertama terakhir diperbaharui pada November 2020 - cukup lama untuk perangkat rumah pintar.\n## 3. iPad Pro dengan Chip M5\nUntuk lini iPad Pro, Apple kemungkinan akan menghadirkan versi \"specced-up\" dengan chip M5. Bocoran menunjukkan:\n- Integrasi chip M5\n- N1 chip nirkabel\n- Varian RAM 12 GB dan 16 GB\n- Kemungkinan kamera depan ganda\n- Potensi adopsi modem C1X yang baru (serupa iPhone)\n\nMeski bukan perubahan radikal dari desain, peningkatan internal ini tetap dinanti oleh pengguna pro.\n## 4. AirTag 2\nMengingat AirTag telah beredar lebih dari empat tahun, kemunculan AirTag generasi kedua dinilai sudah waktunya. Bocoran fitur:\n- Chip Ultra Wideband baru\n- Fitur privasi yang lebih baik\n- Kemampuan \"precision finding\" dengan jangkauan lebih luas\n\nNamun dari segi tampilan dan fungsi dasar, perangkat ini diperkirakan tidak akan jauh berbeda dari model lama.\n## 5. Vision Pro\nSetelah peluncuran Vision Pro di awal 2024, Apple dikabarkan tengah menyiapkan versi baru. Rumor menyebut:\n- Chip M5 atau M4\n- Strap kepala yang lebih nyaman\n- Varian warna hitam\n- Desain umum dan fitur tetap serupa\n\nSelain itu, Apple juga diyakini tengah mengembangkan model yang lebih ringan dan lebih murah dengan nama Vision Air, meski belum diperkirakan hadir dalam waktu dekat.\n\nBonus: MacBook Pro M5 & Studio Display Baru\nDiluar produk-produk tersebut, kemungkinan Apple akan merilis MacBook Pro dengan chip M5 dan display baru pengganti Studio Display. Meski sebagian prediksi menyebut peluncuran MacBook M5 ditunda ke awal 2026, bocoran dari lembaga seperti FCC menunjukkan potensi perilisan lebih cepat."
    },
    {
        "title":"Handling form: The efficient way!",
        "slug":"handling-form-the-efficient-way",
        "date":"2025-10-02T10:08:41+07:00",
        "author":"Fahrul Septiana",
        "username":"fahrulseptiana",
        "image":"https://miro.medium.com/v2/resize:fit:720/format:webp/1*W1WS-7weTeRLQvzNUeSr-Q.png",
        "synopsis":"",
        "body":"Sering kali kita dibingungkan dengan cara handling form di frontend, pada artikel ini mari kita bedah cara-cara melakukan handling form secara efektif dan efisien di frontend!\n## Handling Form dengan DOM\nBanyaknya, ketika kita mencoba untuk mengakses sebuah value didalam form, kita menggunakan cara yang kurang efisien, yakni dengan mengakses input secara satu-persatu!\n### Form dalam HTML\n![full](https://miro.medium.com/v2/resize:fit:720/format:webp/1*NTyOBmtN60WORtVK5pmghA.png)\nDi atas adalah contoh dari sebuah form yang akan diproses lebih lanjut oleh JavaScript ketika di-submit, Ingat! setiap input wajib memiliki attribute type dan name agar input dapat diakses melalui JavaScript dengan mudah, attribute id sifatnya wajib jika kita menggunakan getElementById untuk mengakses input atau jika kita menggunakan tag label untuk memberikan text label setiap input yang dibuat.\n### Proses dalam JavaScript\n![full](https://miro.medium.com/v2/resize:fit:720/format:webp/1*xzjgzFI_hriW2YxTU4lDVg.png)\nCara yang kurang efektif dan efisien\nKode di atas kurang efisien karena kita memanfaatkan attribute id untuk mendapatkan value setiap HTMLInputElement, padahal JavaScript sendiri sudah menyediakan object FormData untuk men-serialize data didalam satu element form, kita bisa mempersingkatnya menjadi seperti berikut:\n![full](https://miro.medium.com/v2/resize:fit:720/format:webp/1*zghAQODPlcx4C84qPky0Ww.png)\nCara yang efektif dan efisien\nSingkatnya, kita dapat men-serialize value dari setiap input menggunakan object FormData melalui object event.target, karena fungsi submitForm yang dibuat akan dipanggil ketika form melakukan event submit yang di-trigger oleh sebuah button dengan type=submit ketika di-klik.\nKedua cara di atas tidak ada yang salah, tujuannya sama, kita ingin mengambil value yang diinputkan oleh user ke dalam form, dan memprosesnya lebih lanjut.\nPada contoh di atas, kita akan mengirimkan data yang diinput ke sebuah backend dengan menggunakan Fetch API, pada bagian body diisi dengan data yang di-input-kan tadi dengan mengkonversinya ke dalam bentuk URLSearchParams atau Query String, agar data dikirimkan dengan Content-Type application/x-www-form-urlencoded."
    },
    {
        "title":"Steam Autumn Sale Digelar, Ini Rekomendasi Game PC Diskon Hingga 90%",
        "slug":"steam-autumn-sale-digelar-ini-rekomendasi-game-pc-diskon-hingga-90",
        "date":"2025-10-02T10:08:41+07:00",
        "author":"Fahrul Septiana",
        "username":"fahrulseptiana",
        "image":"https://awsimages.detik.net.id/community/media/visual/2023/02/08/hogwarts-legacy-segera-rilis-ini-harga-dan-spek-pc-yang-dibutuhkan_169.jpeg?w=700&q=90",
        "synopsis":"",
        "body":"**Jakarta - Valve** kembali menggelar Steam Autumn Sale pada tahun ini. Gamer bisa menikmati sejumlah game PC berkualitas dengan harga yang sangat terjangkau.\nPenawaran menarik ini tidak berlangsung lama, karena akan segera berakhir pada 6 Oktober 2025. Setelah periode promonya berakhir, harga setiap game tersebut akan kembali normal.\nJadi ini merupakan kesempatan baik untuk memiliki game baru, tapi tidak perlu menggelontorkan banyak uang. Diskon yang diberikan pun tak tanggung-tanggung, mengingat gamer bisa mendapat potongan harganya sampai 90%.\n## Daftar Game PC Diskon 90%\n\nDari 25 judul yang didiskon 90%, ada yang dihargai hanya Rp 9 ribuan. Berikut daftarnya, dirangkum detikINET dari Steam, Rabu (1/10/2025).\n- Control - Rp 29.999 dari Rp 299.999\n- Code Vein - Rp 49.900 dari Rp 499.000\n- Old World - Rp 29.999 dari Rp 299.999\n- Elite Dangerous - Rp 19.899 dari 198.999\n- Transport Fever 2 - Rp 29.999 dari Rp 299.999\n- Two Point Campus - Rp 35.999 dari Rp 359.999\n- Far Cry Primal - Rp 34900 dari Rp 349.000\n- South Park: The Fractired But Whole - Rp 34.900 dari Rp 349.000\n- Rise of the Tomb Raider - Rp 32.500 dari 325.000\n- Sniper Elite 5 - Rp 20.999 dari Rp 209.999\n- Monter Train - Rp 20.999 dari Rp 206.999\n- Desperados III - Rp 29.999 dari Rp 299.999\n- Mafia III: Definitive Edition - Rp 34.500 dari Rp 345.000\n- Haven - Rp 20.699 dari Rp 206.999\n- Greef Fall - Rp 29.900 dari Rp 299.000\n- Biped - Rp 11.999 dari Rp 119.999\n- Doom Eternal - Rp 32.999 dari 329.999\n- Watch Dogs 2 - Rp 61.000 dari Rp 619.000\n- Anno 1800 - Rp 61.000 dari Rp 619.000\n- Tom Clancy's Ghost Recon Breakpoint - Rp 61.900 dari Rp 619.000\n- Mass Effect Legendary Edition - Rp 65.900 dari Rp 659.000\n- Sniper Elite 4 - Rp 38.999 dari Rp 389.999\n- Sniper Elite 4 Deluxe Edition - Rp 54.599 dari 545.999\n- Zombie Army 4: Dead War - Rp 37.599 dari Rp 375.999\n- Hitman: Blood Money - Rp 9.099 dari Rp 90.999\n\n## Daftar Game PC Diskon Hingga 90%\n\nSelain daftar game tadi, masih ada beberapa judul yang bisa gamer boyong dengan harga murah. Salah satunya seperti Hogwarts Legacy, yang mana saat ini bisa dibeli seharga Rp 159.800 dari normalnya Rp 799.000.\nLalu juga ada Cyberpunk 2077 yang didiskon 67%. Dengan begitu, gamer cukup menghabiskan uang senilai Rp 244.999 dari aslinya Rp 699.999 untuk memainkan game ini.\nApabila dirasa masih kurang, mungkin sederet game ini bisa menjadi opsi. Mari simak daftarnya berikut.\n- Subnautica - Rp 115.829 dari Rp 350.999\n- Street Fighter 6 - Rp 245.000 dari Rp 490.000\n- Day Z - Rp 324.999 dari Rp 649.999\n- Death Stranding Directors Cut - Rp 269.999 dari Rp 539.999\n- Read Dead Redemption 2 - Rp 219.750 dari Rp 879.000\n- GTA V - Rp 219.500 dari Rp 439.000\n- Warhamer 40.000: Space Marine 2 - Rp 274.500 dari 549.000\n- Goat Simulator 3 - Rp 81.179 dari Rp 245.999\n- Warhammer: Vermintide 2 - Rp 24.599 dari Rp 245.999\n- Prince of Persia The Lost Crown - Rp 160.650-- dari Rp 459.000\n- Son Of The Forest - Rp 81.179 dari Rp 245.999\n- Hades - Rp 51.749 dari Rp 206.999\n- Terraria - Rp 45.499 dari Rp 90.999\n- Dead by Daylight - Rp 87.956 dari Rp 219,890\n- Uncharted: Legact of Thieves Collection - Rp 291.600 dari Rp 729.000\n- Star Wars Outlaws - Rp 364.050 dari Rp 899.000\n- Plants vs, Zombie Garden Warfare 2: Deluxe Edition - Rp 113.700 dari Rp 379.000\n- A Way Out - Rp 75.800 dari Rp 379.000\n- Payday 3 - Rp 105.930 dari Rp 321.000\n- Lost Judgment - Rp 182.700 dari Rp 699.000\n\nSebelum memutuskan untuk membelinya, pastikan perangkat yang gamer miliki bisa menjalankan game tersebut ya. Jika ingin mengetahui apakah spesifikasi PC yang dimiliki mumpuni atau tidak, bisa langsung cek di halaman masing-masing game-nya di Steam."
    }
]